# CannotMoveInView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..CannotMoveInView Property
BuiltInFailures..::..EditingFailures Class See Also
---
Can't move element because the move plane is seen at a very sharp angle in this View
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotMoveInView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotMoveInView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotMoveInView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace